src/main/java/ok/dht/test/slastin/wrk2/data/puts-25000.txt
Running 1m test @ http://localhost:2022
  1 threads and 1 connections
  Thread calibration: mean lat.: 0.907ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.47ms    2.81ms  21.86ms   92.22%
    Req/Sec    26.34k     2.39k   40.89k    72.21%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  710.00us
 75.000%    1.04ms
 90.000%    3.10ms
 99.000%   16.22ms
 99.900%   20.38ms
 99.990%   21.55ms
 99.999%   21.79ms
100.000%   21.87ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.023     0.000000            6         1.00
       0.168     0.100000       125819         1.11
       0.306     0.200000       250517         1.25
       0.442     0.300000       375132         1.43
       0.577     0.400000       500378         1.67
       0.710     0.500000       625313         2.00
       0.777     0.550000       688300         2.22
       0.843     0.600000       750616         2.50
       0.909     0.650000       813136         2.86
       0.974     0.700000       875514         3.33
       1.039     0.750000       938110         4.00
       1.071     0.775000       969034         4.44
       1.132     0.800000      1000066         5.00
       1.249     0.825000      1031166         5.71
       1.530     0.850000      1062409         6.67
       2.089     0.875000      1093678         8.00
       2.515     0.887500      1109326         8.89
       3.101     0.900000      1124929        10.00
       3.761     0.912500      1140558        11.43
       4.439     0.925000      1156181        13.33
       5.255     0.937500      1171773        16.00
       5.823     0.943750      1179628        17.78
       6.475     0.950000      1187422        20.00
       7.395     0.956250      1195209        22.86
       8.943     0.962500      1203019        26.67
      10.439     0.968750      1210848        32.00
      11.103     0.971875      1214739        35.56
      11.735     0.975000      1218670        40.00
      12.463     0.978125      1222570        45.71
      13.327     0.981250      1226493        53.33
      14.263     0.984375      1230362        64.00
      14.775     0.985938      1232331        71.11
      15.207     0.987500      1234274        80.00
      15.807     0.989062      1236226        91.43
      16.479     0.990625      1238221       106.67
      17.071     0.992188      1240161       128.00
      17.295     0.992969      1241172       142.22
      17.567     0.993750      1242079       160.00
      17.903     0.994531      1243091       182.86
      18.239     0.995313      1244061       213.33
      18.607     0.996094      1245020       256.00
      18.799     0.996484      1245539       284.44
      18.975     0.996875      1245983       320.00
      19.151     0.997266      1246484       365.71
      19.343     0.997656      1246954       426.67
      19.647     0.998047      1247459       512.00
      19.791     0.998242      1247691       568.89
      19.951     0.998437      1247961       640.00
      20.127     0.998633      1248188       731.43
      20.223     0.998828      1248419       853.33
      20.415     0.999023      1248679      1024.00
      20.511     0.999121      1248790      1137.78
      20.607     0.999219      1248916      1280.00
      20.687     0.999316      1249035      1462.86
      20.815     0.999414      1249162      1706.67
      20.943     0.999512      1249283      2048.00
      21.055     0.999561      1249338      2275.56
      21.071     0.999609      1249411      2560.00
      21.151     0.999658      1249456      2925.71
      21.231     0.999707      1249529      3413.33
      21.279     0.999756      1249579      4096.00
      21.359     0.999780      1249622      4551.11
      21.375     0.999805      1249647      5120.00
      21.391     0.999829      1249682      5851.43
      21.455     0.999854      1249711      6826.67
      21.519     0.999878      1249734      8192.00
      21.535     0.999890      1249750      9102.22
      21.551     0.999902      1249789     10240.00
      21.551     0.999915      1249789     11702.86
      21.567     0.999927      1249817     13653.33
      21.567     0.999939      1249817     16384.00
      21.567     0.999945      1249817     18204.44
      21.583     0.999951      1249830     20480.00
      21.583     0.999957      1249830     23405.71
      21.599     0.999963      1249842     27306.67
      21.615     0.999969      1249847     32768.00
      21.631     0.999973      1249853     36408.89
      21.631     0.999976      1249853     40960.00
      21.679     0.999979      1249858     46811.43
      21.711     0.999982      1249862     54613.33
      21.743     0.999985      1249866     65536.00
      21.743     0.999986      1249866     72817.78
      21.775     0.999988      1249870     81920.00
      21.775     0.999989      1249870     93622.86
      21.807     0.999991      1249873    109226.67
      21.823     0.999992      1249875    131072.00
      21.823     0.999993      1249875    145635.56
      21.839     0.999994      1249878    163840.00
      21.839     0.999995      1249878    187245.71
      21.839     0.999995      1249878    218453.33
      21.855     0.999996      1249880    262144.00
      21.855     0.999997      1249880    291271.11
      21.855     0.999997      1249880    327680.00
      21.855     0.999997      1249880    374491.43
      21.871     0.999998      1249883    436906.67
      21.871     1.000000      1249883          inf
#[Mean    =        1.471, StdDeviation   =        2.808]
#[Max     =       21.856, Total count    =      1249883]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1499960 requests in 1.00m, 95.84MB read
Requests/sec:  24999.54
Transfer/sec:      1.60MB