src/main/java/ok/dht/test/slastin/wrk2/data/puts-27500.txt
Running 1m test @ http://localhost:2022
  1 threads and 1 connections
  Thread calibration: mean lat.: 15.306ms, rate sampling interval: 112ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    11.34ms   30.77ms 178.30ms   91.38%
    Req/Sec    27.63k     1.85k   37.77k    81.84%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  780.00us
 75.000%    2.60ms
 90.000%   29.26ms
 99.000%  156.54ms
 99.900%  171.65ms
 99.990%  177.41ms
 99.999%  178.30ms
100.000%  178.43ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.022     0.000000            1         1.00
       0.179     0.100000       138158         1.11
       0.329     0.200000       275035         1.25
       0.480     0.300000       412651         1.43
       0.630     0.400000       550273         1.67
       0.780     0.500000       688325         2.00
       0.853     0.550000       756275         2.22
       0.928     0.600000       825764         2.50
       1.001     0.650000       893930         2.86
       1.075     0.700000       963270         3.33
       2.595     0.750000      1031176         4.00
       4.239     0.775000      1065551         4.44
       6.155     0.800000      1099952         5.00
       8.655     0.825000      1134315         5.71
      12.199     0.850000      1168694         6.67
      19.279     0.875000      1203035         8.00
      23.887     0.887500      1220272         8.89
      29.263     0.900000      1237437        10.00
      40.767     0.912500      1254593        11.43
      51.519     0.925000      1271790        13.33
      64.703     0.937500      1288976        16.00
      75.519     0.943750      1297568        17.78
      85.119     0.950000      1306155        20.00
      94.143     0.956250      1314768        22.86
     108.991     0.962500      1323354        26.67
     122.175     0.968750      1331916        32.00
     128.639     0.971875      1336229        35.56
     136.703     0.975000      1340541        40.00
     141.951     0.978125      1344896        45.71
     145.407     0.981250      1349159        53.33
     148.735     0.984375      1353406        64.00
     151.039     0.985938      1355638        71.11
     153.215     0.987500      1357793        80.00
     155.391     0.989062      1359927        91.43
     157.311     0.990625      1362013       106.67
     159.359     0.992188      1364174       128.00
     160.511     0.992969      1365295       142.22
     161.535     0.993750      1366383       160.00
     162.303     0.994531      1367367       182.86
     163.071     0.995313      1368460       213.33
     164.223     0.996094      1369523       256.00
     164.991     0.996484      1370078       284.44
     165.759     0.996875      1370637       320.00
     166.527     0.997266      1371141       365.71
     167.295     0.997656      1371670       426.67
     168.191     0.998047      1372239       512.00
     168.575     0.998242      1372475       568.89
     169.215     0.998437      1372734       640.00
     170.111     0.998633      1373023       731.43
     170.879     0.998828      1373271       853.33
     171.775     0.999023      1373555      1024.00
     172.159     0.999121      1373693      1137.78
     172.543     0.999219      1373828      1280.00
     172.927     0.999316      1373953      1462.86
     173.439     0.999414      1374115      1706.67
     173.823     0.999512      1374241      2048.00
     173.951     0.999561      1374291      2275.56
     174.207     0.999609      1374376      2560.00
     174.463     0.999658      1374437      2925.71
     174.847     0.999707      1374482      3413.33
     175.615     0.999756      1374559      4096.00
     175.871     0.999780      1374588      4551.11
     176.127     0.999805      1374615      5120.00
     176.511     0.999829      1374655      5851.43
     176.767     0.999854      1374681      6826.67
     177.151     0.999878      1374723      8192.00
     177.279     0.999890      1374735      9102.22
     177.407     0.999902      1374747     10240.00
     177.663     0.999915      1374772     11702.86
     177.791     0.999927      1374794     13653.33
     177.919     0.999939      1374819     16384.00
     177.919     0.999945      1374819     18204.44
     177.919     0.999951      1374819     20480.00
     178.047     0.999957      1374837     23405.71
     178.047     0.999963      1374837     27306.67
     178.175     0.999969      1374854     32768.00
     178.175     0.999973      1374854     36408.89
     178.175     0.999976      1374854     40960.00
     178.175     0.999979      1374854     46811.43
     178.303     0.999982      1374871     54613.33
     178.303     0.999985      1374871     65536.00
     178.303     0.999986      1374871     72817.78
     178.303     0.999988      1374871     81920.00
     178.303     0.999989      1374871     93622.86
     178.303     0.999991      1374871    109226.67
     178.303     0.999992      1374871    131072.00
     178.431     0.999993      1374881    145635.56
     178.431     1.000000      1374881          inf
#[Mean    =       11.342, StdDeviation   =       30.770]
#[Max     =      178.304, Total count    =      1374881]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1649976 requests in 1.00m, 105.43MB read
Requests/sec:  27499.64
Transfer/sec:      1.76MB